# Why we should concern about data formatting? 


Data are usually collected from different places and stored in different formats.

Bringing data into a common standard of expression allows users to make meaningful comparison.

So, we should format to turn easy aggregate and easy to compare, besides  to turn the value more clear.


Examples:


Female, Famme, She, Woman, etc. all this could become -->  'F'
NY, N.Y, New York, N.York all this could become --> New York

## Example 1

Here we want to transform feet to inch

In [39]:
import pandas as pd

dict_metrics = {'productId': [1,2,3,4,5,6,7,8,9,10], 
           'feet': [5,6,2,20,50,5,8,9,20,7], 
           'weight in kg': ['2','3','5','61','6','4','2','4','7','1']}

df_metrics = pd.DataFrame(dict_metrics)

df_metrics

   productId  feet weight in kg
0          1     5            2
1          2     6            3
2          3     2            5
3          4    20           61
4          5    50            6
5          6     5            4
6          7     8            2
7          8     9            4
8          9    20            7
9         10     7            1

In [40]:
#This way will overwrite the column 'feet' but you can instead create a new column too, it is up to you
df_metrics['feet'] = df_metrics['feet'] * 12

# print the result
df_metrics['feet']

0     60
1     72
2     24
3    240
4    600
5     60
6     96
7    108
8    240
9     84
Name: feet, dtype: int64

In [41]:
#Now do not make sense continuing call this atributte 'feet'. Let's rename the column to 'inches'

df_metrics.rename(columns={'feet': 'inches'} , inplace=True)

In [42]:
#Print the result
df_metrics

   productId  inches weight in kg
0          1      60            2
1          2      72            3
2          3      24            5
3          4     240           61
4          5     600            6
5          6      60            4
6          7      96            2
7          8     108            4
8          9     240            7
9         10      84            1

## Example 2

Here is about data type. It is common some attributes, that should be integer, come as a string, which difficult numeric operations

Imagine now we want to tranform the attribute 'weight in gramas' into 'kilogramas'. It will not be possible while its data type is object.

In [47]:
df_metrics.dtypes

productId          int64
inches             int64
weight in kg       int64
weight in grams    int64
dtype: object

In [44]:
df_metrics['weight in kg'] = df_metrics['weight in kg'].astype('int')

In [45]:
#This time I will create a new column

df_metrics['weight in grams'] = df_metrics['weight in kg'] * 1000

In [46]:
df_metrics

   productId  inches  weight in kg  weight in grams
0          1      60             2             2000
1          2      72             3             3000
2          3      24             5             5000
3          4     240            61            61000
4          5     600             6             6000
5          6      60             4             4000
6          7      96             2             2000
7          8     108             4             4000
8          9     240             7             7000
9         10      84             1             1000

In [48]:
#See the final data type 
df_metrics.dtypes

productId          int64
inches             int64
weight in kg       int64
weight in grams    int64
dtype: object